{
    "planets": [
        {
            "id": 1,
            "name": "Mercury",
            "distance_from_sun": "0.39 AU (about 57.9 million km)",
            "rotation_period": "59 Earth days",
            "orbital_period": "88 Earth days",
            "radius": "2,439.7 km",
            "average_temperature": "167°C (varies greatly between day and night)",
            "average_orbital_speed": "47.87 km/s",
            "satellites": "0",
            "mass": "3.301×10^23 kg",
            "mass_comparison_to_earth": "About 0.055 times the mass of Earth.",
            "summary": "The closest planet to the Sun, Mercury is a small rocky body that experiences extreme temperatures, varying greatly between day and night. With no real atmosphere, it retains neither heat nor water.",
            "details": "Positioning itself as the smallest and closest planet to the Sun, Mercury has always been a challenge for astronomers. Its proximity to the Sun means it is only visible during twilight, just before sunrise or after sunset. Although it resembles the Moon with its crater-pocked terrain, Mercury hides secrets, such as the possible presence of ice in shadowed craters near its poles. With no real atmosphere to retain heat, temperatures can soar up to 430°C during the day and plummet to -180°C at night."
        },
        {
            "id": 2,
            "name": "Venus",
            "distance_from_sun": "0.72 AU (about 108.2 million km)",
            "rotation_period": "243 Earth days (retrograde rotation)",
            "orbital_period": "225 Earth days",
            "radius": "6,051.8 km",
            "average_temperature": "464°C",
            "average_orbital_speed": "35.02 km/s",
            "satellites": "0",
            "mass": "4.867×10^24 kg",
            "mass_comparison_to_earth": "About 0.815 times the mass of Earth.",
            "summary": "Often called Earth's \"twin sister\" due to its similar size, Venus is nevertheless a radically different world. With a thick atmosphere and clouds of sulfuric acid, its surface is hot enough to melt lead.",
            "details": "Being the second planet from the Sun, Venus is sometimes nicknamed the \"morning star\", \"evening star\", or the \"shepherd's star\" due to its brightness. Its rotation is unique as it spins in the opposite direction of other planets, and astonishingly, a day on Venus is longer than a Venusian year. Its thick atmosphere is composed primarily of carbon dioxide with clouds of sulfuric acid, creating an intense greenhouse effect, making Venus the hottest planet in the solar system."
        },
        {
            "id": 3,
            "name": "Earth",
            "distance_from_sun": "1 AU (about 149.6 million km)",
            "rotation_period": "24 hours",
            "orbital_period": "365.25 days",
            "radius": "6,371 km",
            "average_temperature": "14°C",
            "average_orbital_speed": "29.78 km/s",
            "satellites": "1",
            "mass": "5.972×10^24 kg",
            "mass_comparison_to_earth": "N/A",
            "summary": "Our home planet, Earth is the only known place to harbor life. With oceans of liquid water and an oxygen-rich atmosphere, it offers a variety of climates and landscapes.",
            "details": "Earth is unique in its kind within our solar system. With its oxygen-rich atmosphere, vast oceans of water, and protective magnetic field shield, it offers an ideal habitat for an incredible variety of life. The diverse climatic conditions, from majestic mountains to mysterious oceanic depths, from arid deserts to humid tropical forests, provide varied habitats for countless species. Earth is also the only known planet to have liquid water on its surface, an essential element for life as we know it."
        },
        {
            "id": 4,
            "name": "Mars",
            "distance_from_sun": "1.52 AU (about 227.9 million km)",
            "rotation_period": "24.6 hours",
            "orbital_period": "687 Earth days",
            "radius": "3,389.5 km",
            "average_temperature": "-63°C",
            "average_orbital_speed": "24.077 km/s",
            "satellites": "2",
            "mass": "6.417×10^23 kg",
            "mass_comparison_to_earth": "About 0.107 times the mass of Earth.",
            "summary": "The \"Red Planet\", Mars is a desert-like world with a thin atmosphere. Fascinating astronomers and explorers for centuries, it's the target of many missions searching for signs of past life.",
            "details": "Dubbed the \"Red Planet\" due to its distinctive color, Mars has captivated the human imagination since time immemorial. With its vast plains, towering volcanoes, and deep canyons, the Martian landscape is as varied as it is fascinating. Mars is a desert world, with sandstorms sometimes engulfing the entire planet. Although the current atmosphere is thin and dominated by carbon dioxide, evidence suggests Mars once had liquid water on its surface. Exploration missions continue to investigate the possibility that life might have once existed there."
        },
        {
            "id": 5,
            "name": "Jupiter",
            "distance_from_sun": "5.2 AU (about 778.3 million km)",
            "rotation_period": "9.9 hours",
            "orbital_period": "11.9 Earth years",
            "radius": "69,911 km",
            "average_temperature": "-108°C (in the upper clouds)",
            "average_orbital_speed": "13.07 km/s",
            "satellites": "79",
            "mass": "1.898×10^27 kg",
            "mass_comparison_to_earth": "About 317.8 times the mass of Earth.",
            "summary": "The largest planet in our solar system, Jupiter is a gas giant primarily made up of hydrogen and helium. With its Great Red Spot and many moons, it's a fascinating subject of study for astronomers.",
            "details": "The majesty of the solar system, Jupiter is the largest of the planets and perhaps the most intriguing to observe with its colorful bands and its Great Red Spot, a giant storm that has been raging for at least 400 years. Jupiter has more than double the mass of all other planets combined, and its gravitational strength has had a significant impact on the trajectory of many celestial objects; some believe it plays a protective role by deflecting comets and asteroids away from Earth. Its moons, especially Ganymede (the largest moon in the solar system) and Europa (which might house a subglacial ocean), are subjects of study and fascination."
        },
        {
            "id": 6,
            "name": "Saturn",
            "distance_from_sun": "9.58 AU (about 1.4 billion km)",
            "rotation_period": "10.7 hours",
            "orbital_period": "29.5 Earth years",
            "radius": "58,232 km",
            "average_temperature": "-139°C",
            "average_orbital_speed": "9.68 km/s",
            "satellites": "82",
            "mass": "5.683×10^26 kg",
            "mass_comparison_to_earth": "About 95.2 times the mass of Earth.",
            "summary": "Known for its impressive rings, Saturn is another gas giant, with an atmosphere dominated by hydrogen. Its rings are made up of millions of particles of ice, rock, and dust.",
            "details": "Perhaps no space image is as iconic as that of Saturn's ethereal rings. These rings, made up of billions of ice particles, some as tiny as grains of sand, others as large as mountains, along with rock and dust, encircle the second-largest planet in the solar system. Besides its rings, Saturn boasts numerous moons, with Titan being most notable due to its dense atmosphere and the possibility it contains lakes of liquid methane."
        },
        {
            "id": 7,
            "name": "Uranus",
            "distance_from_sun": "19.22 AU (about 2.9 billion km)",
            "rotation_period": "17.2 hours",
            "orbital_period": "84 Earth years",
            "radius": "25,362 km",
            "average_temperature": "-224°C",
            "average_orbital_speed": "6.81 km/s",
            "satellites": "27",
            "mass": "8.681×10^25 kg",
            "mass_comparison_to_earth": "About 14.5 times the mass of Earth.",
            "summary": "Unusual in its \"tipped over\" rotation, Uranus is often referred to as the \"sideways planet\". This ice giant has a blue-green color due to the presence of methane in its atmosphere.",
            "details": "With its extremely tilted rotation axis, Uranus quite literally rolls around the Sun (in doing so, one season can last over 20 years). This tilt, combined with its blue-green hue (due to methane in its atmosphere which absorbs red light), makes it a unique planet. Although less famous than its gas giant cousins Jupiter and Saturn, Uranus has subtle charm with its cool shades and thin rings."
        },
        {
            "id": 8,
            "name": "Neptune",
            "distance_from_sun": "30.05 AU (about 4.5 billion km)",
            "rotation_period": "16.1 hours",
            "orbital_period": "164.8 Earth years",
            "radius": "24,622 km",
            "average_temperature": "-218°C",
            "average_orbital_speed": "5.43 km/s",
            "satellites": "14",
            "mass": "1.024×10^26 kg",
            "mass_comparison_to_earth": "About 17.1 times the mass of Earth.",
            "summary": "The furthest planet from the Sun, Neptune is famous for its beautiful blue hue and fierce winds. Like Uranus, it's classified among the ice giants and has an atmosphere rich in methane.",
            "details": "Orchestrating a slow dance around the Sun, Neptune is the furthest planet in the solar system since Pluto's reclassification. It's known for its furious winds, the fastest in the solar system (with speeds reaching up to 2,100 km/h), and its deep blue color. Triton, its largest moon, intrigues scientists as it displays geological activity with eruptive geysers spewing liquid nitrogen. Neptune's distance and mystery make it a constant subject of interest for astronomers."
        }
    ]
}
